//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneLogo.h
//!
//! @brief  ロゴシーン関連のヘッダファイル
//!
//! @date   2017.7.31
//!
//! @author GF1.21.深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================





// 関数の宣言 ==============================================================

// ロゴシーンの初期化処理
void InitializeLogo(void);

// ロゴシーンの更新処理
void UpdateLogo(void);

// ロゴシーンの描画処理
void RenderLogo(void);

// ロゴシーンの終了処理
void FinalizeLogo(void);
