//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneResult.h
//!
//! @brief  SceneResultのヘッダファイル
//!
//! @date   
//!
//! @author 深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================





// 関数の宣言 ==============================================================

// SceneResultの初期化処理
void InitializeResult(void);

// SceneResultの更新処理
void UpdateResult(void);

// SceneResultの描画処理
void RenderResult(void);

// SceneResultの終了処理
void FinalizeResult(void);
