//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneTitle.h
//!
//! @brief  SceneTitleのヘッダファイル
//!
//! @date   
//!
//! @author 深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================





// 関数の宣言 ==============================================================

// SceneTitleの初期化処理
void InitializeTitle(void);

// SceneTitleの更新処理
void UpdateTitle(void);

// SceneTitleの描画処理
void RenderTitle(void);

// SceneTitleの終了処理
void FinalizeTitle(void);
