//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneReady.h
//!
//! @brief  SceneReadyのヘッダファイル
//!
//! @date   
//!
//! @author 深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================





// 関数の宣言 ==============================================================

// SceneReadyの初期化処理
void InitializeReady(void);

// SceneReadyの更新処理
void UpdateReady(void);

// SceneReadyの描画処理
void RenderReady(void);

// SceneReadyの終了処理
void FinalizeReady(void);
