//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   ScenePlaying.h
//!
//! @brief  ScenePlayingのヘッダファイル
//!
//! @date   
//!
//! @author 深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================





// 関数の宣言 ==============================================================

// ScenePlayの初期化処理
void InitializePlaying(void);

// ScenePlayの更新処理
void UpdatePlaying(void);

// ScenePlayの描画処理
void RenderPlaying(void);

// ScenePlayの終了処理
void FinalizePlaying(void);
